shijoe4/zephyr/ext/hal/nxp/mcux/devices/MKW21Z4/MKW21Z4.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>RSIM</name>
      <description>RSIM</description>
      <baseAddress>0x40059000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x130</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CONTROL</name>
          <description>Radio System Control</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC00002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BLE_RF_OSC_REQ_EN</name>
              <description>BLE Ref Osc (Sysclk) Request Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE_RF_OSC_REQ_STAT</name>
              <description>BLE Ref Osc (Sysclk) Request Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BLE_RF_OSC_REQ_INT_EN</name>
              <description>BLE Ref Osc (Sysclk) Request Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE_RF_OSC_REQ_INT</name>
              <description>BLE Ref Osc (Sysclk) Request Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_OSC_EN</name>
              <description>RF Ref Osc Enable Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>RF Ref Osc will be controlled by the SoC, external pin, or a link layer</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>RF Ref Osc on in Run/Wait</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>RF Ref Osc on in Stop</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>RF Ref Osc on in VLPR/VLPW</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>RF Ref Osc on in VLPS</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RADIO_GASKET_BYPASS_OVRD_EN</name>
              <description>Radio Gasket Bypass Override Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RADIO_GASKET_BYPASS_OVRD</name>
              <description>Radio Gasket Bypass Override</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPP_OBE_3V_BLE_ACTIVE_1</name>
              <description>IPP_OBE_3V_BLE_ACTIVE_1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPP_OBE_3V_BLE_ACTIVE_2</name>
              <description>IPP_OBE_3V_BLE_ACTIVE_2</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RADIO_RAM_ACCESS_OVRD_EN</name>
              <description>Radio RAM Access Override Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RADIO_RAM_ACCESS_OVRD</name>
              <description>Radio RAM Access Override</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSIM_DSM_EXIT</name>
              <description>BLE Force Deep Sleep Mode Exit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSIM_STOP_ACK_OVRD_EN</name>
              <description>Stop Acknowledge Override Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSIM_STOP_ACK_OVRD</name>
              <description>Stop Acknowledge Override</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_OSC_READY</name>
              <description>RF Ref Osc Ready</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RF_OSC_READY_OVRD_EN</name>
              <description>RF Ref Osc Ready Override Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_OSC_READY_OVRD</name>
              <description>RF Ref Osc Ready Override</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLOCK_SOC_RESETS</name>
              <description>Block SoC Resets of the Radio</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLOCK_RADIO_OUTPUTS</name>
              <description>Block Radio Outputs</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALLOW_DFT_RESETS</name>
              <description>Allow the DFT Reset Pin to Reset the Radio</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RADIO_RESET_BIT</name>
              <description>Software Reset for the Radio</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACTIVE_DELAY</name>
          <description>Radio Active Early Warning</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BLE_FINE_DELAY</name>
              <description>BLE Active Fine Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE_COARSE_DELAY</name>
              <description>BLE Active Coarse Delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_MSB</name>
          <description>Radio MAC Address</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAC_ADDR_MSB</name>
              <description>Radio MAC Address MSB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_LSB</name>
          <description>Radio MAC Address</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAC_ADDR_LSB</name>
              <description>Radio MAC Address LSB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC</name>
          <description>Radio Miscellaneous</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ANALOG_TEST_EN</name>
              <description>RSIM Analog Test Mux Enables</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RADIO_VERSION</name>
              <description>Radio Version ID number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSM_TIMER</name>
          <description>Deep Sleep Timer</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DSM_TIMER</name>
              <description>Deep Sleep Mode Timer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSM_CONTROL</name>
          <description>Deep Sleep Timer Control</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DSM_ANT_READY</name>
              <description>ANT Ready for Deep Sleep Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ANT_DEEP_SLEEP_STATUS</name>
              <description>ANT Link Layer Deep Sleep Mode Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DSM_ANT_FINISHED</name>
              <description>ANT Deep Sleep Time Finished</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ANT_SYSCLK_REQUEST_EN</name>
              <description>Enable ANT Link Layer to Request RF OSC</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANT_SLEEP_REQUEST</name>
              <description>ANT Link Layer Deep Sleep Requested</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ANT_SYSCLK_REQ</name>
              <description>ANT Link Layer RF OSC Request Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ANT_SYSCLK_INTERRUPT_EN</name>
              <description>ANT Link Layer RF OSC Request Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANT_SYSCLK_REQ_INT</name>
              <description>Interrupt Flag from an ANT Link Layer RF OSC Request</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSM_GEN_READY</name>
              <description>Generic FSK Ready for Deep Sleep Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GEN_DEEP_SLEEP_STATUS</name>
              <description>Generic FSK Link Layer Deep Sleep Mode Status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DSM_GEN_FINISHED</name>
              <description>Generic FSK Deep Sleep Time Finished</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GEN_SYSCLK_REQUEST_EN</name>
              <description>Enable Generic FSK Link Layer to Request RF OSC</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GEN_SLEEP_REQUEST</name>
              <description>Generic FSK Link Layer Deep Sleep Requested</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GEN_SYSCLK_REQ</name>
              <description>Generic FSK Link Layer RF OSC Request Status</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GEN_SYSCLK_INTERRUPT_EN</name>
              <description>Generic FSK Link Layer RF OSC Request Interrupt Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GEN_SYSCLK_REQ_INT</name>
              <description>Interrupt Flag from an Generic FSK Link Layer RF OSC Request</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DSM_ZIG_READY</name>
              <description>802.15.4 Ready for Deep Sleep Mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ZIG_DEEP_SLEEP_STATUS</name>
              <description>802.15.4 Link Layer Deep Sleep Mode Status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DSM_ZIG_FINISHED</name>
              <description>802.15.4 Deep Sleep Time Finished</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ZIG_SYSCLK_REQUEST_EN</name>
              <description>Enable 802.15.4 Link Layer to Request RF OSC</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ZIG_SLEEP_REQUEST</name>
              <description>802.15.4 Link Layer Deep Sleep Requested</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ZIG_SYSCLK_REQ</name>
              <description>802.15.4 Link Layer RF OSC Request Status</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ZIG_SYSCLK_INTERRUPT_EN</name>
              <description>802.15.4 Link Layer RF OSC Request Interrupt Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ZIG_SYSCLK_REQ_INT</name>
              <description>Interrupt Flag from an 802.15.4 Link Layer RF OSC Request</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DSM_TIMER_CLR</name>
              <description>Deep Sleep Mode Timer Clear</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSM_TIMER_EN</name>
              <description>Deep Sleep Mode Timer Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSM_OSC_OFFSET</name>
          <description>Deep Sleep Wakeup Time Offset</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DSM_OSC_STABILIZE_TIME</name>
              <description>Deep Sleep Wakeup RF OSC Stabilize Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANT_SLEEP</name>
          <description>ANT Link Layer Sleep Time</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ANT_SLEEP_TIME</name>
              <description>ANT Link Layer Sleep Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANT_WAKE</name>
          <description>ANT Link Layer Wake Time</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ANT_WAKE_TIME</name>
              <description>ANT Link Layer Wake Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ZIG_SLEEP</name>
          <description>802.15.4 Link Layer Sleep Time</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ZIG_SLEEP_TIME</name>
              <description>802.15.4 Link Layer Sleep Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ZIG_WAKE</name>
          <description>802.15.4 Link Layer Wake Time</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ZIG_WAKE_TIME</name>
              <description>802.15.4 Link Layer Wake Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GEN_SLEEP</name>
          <description>Generic FSK Link Layer Sleep Time</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GEN_SLEEP_TIME</name>
              <description>Generic FSK Link Layer Sleep Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GEN_WAKE</name>
          <description>Generic FSK Link Layer Wake Time</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GEN_WAKE_TIME</name>
              <description>Generic FSK Link Layer Wake Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
