shijoe4/zephyr/ext/hal/nxp/mcux/devices/MKW21Z4/MKW21Z4.xml
        <register>
          <name>DCOC_OFFSET_7</name>
          <description>DCOC Offset</description>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_BBA_OFFSET_I</name>
              <description>DCOC BBA I-channel offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_BBA_OFFSET_Q</name>
              <description>DCOC BBA Q-channel offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_I</name>
              <description>DCOC TZA I-channel offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_Q</name>
              <description>DCOC TZA Q-channel offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_OFFSET_8</name>
          <description>DCOC Offset</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_BBA_OFFSET_I</name>
              <description>DCOC BBA I-channel offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_BBA_OFFSET_Q</name>
              <description>DCOC BBA Q-channel offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_I</name>
              <description>DCOC TZA I-channel offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_Q</name>
              <description>DCOC TZA Q-channel offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_OFFSET_9</name>
          <description>DCOC Offset</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_BBA_OFFSET_I</name>
              <description>DCOC BBA I-channel offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_BBA_OFFSET_Q</name>
              <description>DCOC BBA Q-channel offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_I</name>
              <description>DCOC TZA I-channel offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_Q</name>
              <description>DCOC TZA Q-channel offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_OFFSET_10</name>
          <description>DCOC Offset</description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_BBA_OFFSET_I</name>
              <description>DCOC BBA I-channel offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_BBA_OFFSET_Q</name>
              <description>DCOC BBA Q-channel offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_I</name>
              <description>DCOC TZA I-channel offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_Q</name>
              <description>DCOC TZA Q-channel offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_OFFSET_11</name>
          <description>DCOC Offset</description>
          <addressOffset>0xCC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_BBA_OFFSET_I</name>
              <description>DCOC BBA I-channel offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_BBA_OFFSET_Q</name>
              <description>DCOC BBA Q-channel offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_I</name>
              <description>DCOC TZA I-channel offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_Q</name>
              <description>DCOC TZA Q-channel offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_OFFSET_12</name>
          <description>DCOC Offset</description>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_BBA_OFFSET_I</name>
              <description>DCOC BBA I-channel offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_BBA_OFFSET_Q</name>
              <description>DCOC BBA Q-channel offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_I</name>
              <description>DCOC TZA I-channel offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_Q</name>
              <description>DCOC TZA Q-channel offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_OFFSET_13</name>
          <description>DCOC Offset</description>
          <addressOffset>0xD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_BBA_OFFSET_I</name>
              <description>DCOC BBA I-channel offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_BBA_OFFSET_Q</name>
              <description>DCOC BBA Q-channel offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_I</name>
              <description>DCOC TZA I-channel offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_Q</name>
              <description>DCOC TZA Q-channel offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_OFFSET_14</name>
          <description>DCOC Offset</description>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_BBA_OFFSET_I</name>
              <description>DCOC BBA I-channel offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_BBA_OFFSET_Q</name>
              <description>DCOC BBA Q-channel offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_I</name>
              <description>DCOC TZA I-channel offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_Q</name>
              <description>DCOC TZA Q-channel offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_OFFSET_15</name>
          <description>DCOC Offset</description>
          <addressOffset>0xDC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_BBA_OFFSET_I</name>
              <description>DCOC BBA I-channel offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_BBA_OFFSET_Q</name>
              <description>DCOC BBA Q-channel offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_I</name>
              <description>DCOC TZA I-channel offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_Q</name>
              <description>DCOC TZA Q-channel offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_OFFSET_16</name>
          <description>DCOC Offset</description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_BBA_OFFSET_I</name>
              <description>DCOC BBA I-channel offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_BBA_OFFSET_Q</name>
              <description>DCOC BBA Q-channel offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_I</name>
              <description>DCOC TZA I-channel offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_Q</name>
              <description>DCOC TZA Q-channel offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_OFFSET_17</name>
          <description>DCOC Offset</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_BBA_OFFSET_I</name>
              <description>DCOC BBA I-channel offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_BBA_OFFSET_Q</name>
              <description>DCOC BBA Q-channel offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_I</name>
              <description>DCOC TZA I-channel offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_Q</name>
              <description>DCOC TZA Q-channel offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_OFFSET_18</name>
          <description>DCOC Offset</description>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_BBA_OFFSET_I</name>
              <description>DCOC BBA I-channel offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_BBA_OFFSET_Q</name>
              <description>DCOC BBA Q-channel offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_I</name>
              <description>DCOC TZA I-channel offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_Q</name>
              <description>DCOC TZA Q-channel offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_OFFSET_19</name>
          <description>DCOC Offset</description>
          <addressOffset>0xEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_BBA_OFFSET_I</name>
              <description>DCOC BBA I-channel offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_BBA_OFFSET_Q</name>
              <description>DCOC BBA Q-channel offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_I</name>
              <description>DCOC TZA I-channel offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_Q</name>
              <description>DCOC TZA Q-channel offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_OFFSET_20</name>
          <description>DCOC Offset</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_BBA_OFFSET_I</name>
              <description>DCOC BBA I-channel offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_BBA_OFFSET_Q</name>
              <description>DCOC BBA Q-channel offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_I</name>
              <description>DCOC TZA I-channel offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_Q</name>
              <description>DCOC TZA Q-channel offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_OFFSET_21</name>
          <description>DCOC Offset</description>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_BBA_OFFSET_I</name>
              <description>DCOC BBA I-channel offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_BBA_OFFSET_Q</name>
              <description>DCOC BBA Q-channel offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_I</name>
              <description>DCOC TZA I-channel offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_Q</name>
              <description>DCOC TZA Q-channel offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_OFFSET_22</name>
          <description>DCOC Offset</description>
          <addressOffset>0xF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_BBA_OFFSET_I</name>
              <description>DCOC BBA I-channel offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_BBA_OFFSET_Q</name>
              <description>DCOC BBA Q-channel offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_I</name>
              <description>DCOC TZA I-channel offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_Q</name>
              <description>DCOC TZA Q-channel offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
