shijoe4/zephyr/ext/hal/nxp/mcux/devices/MKW21Z4/MKW21Z4.xml
        <register>
          <name>OVRD3</name>
          <description>TSM OVERRIDE REGISTER 3</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSM_SPARE0_EN_OVRD_EN</name>
              <description>Override control for TSM_SPARE0_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of TSM_SPARE0_EN_OVRD to override the signal &quot;tsm_spare0_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSM_SPARE0_EN_OVRD</name>
              <description>Override value for TSM_SPARE0_EN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE1_EN_OVRD_EN</name>
              <description>Override control for TSM_SPARE1_EN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of TSM_SPARE1_EN_OVRD to override the signal &quot;tsm_spare1_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSM_SPARE1_EN_OVRD</name>
              <description>Override value for TSM_SPARE1_EN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE2_EN_OVRD_EN</name>
              <description>Override control for TSM_SPARE2_EN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of TSM_SPARE2_EN_OVRD to override the signal &quot;tsm_spare2_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSM_SPARE2_EN_OVRD</name>
              <description>Override value for TSM_SPARE2_EN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE3_EN_OVRD_EN</name>
              <description>Override control for TSM_SPARE3_EN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of TSM_SPARE3_EN_OVRD to override the signal &quot;tsm_spare3_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSM_SPARE3_EN_OVRD</name>
              <description>Override value for TSM_SPARE3_EN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_BIAS_EN_OVRD_EN</name>
              <description>Override control for RXTX_AUXPLL_BIAS_EN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of RXTX_AUXPLL_BIAS_EN_OVRD to override the signal &quot;rxtx_auxpll_bias_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXTX_AUXPLL_BIAS_EN_OVRD</name>
              <description>Override value for RXTX_AUXPLL_BIAS_EN</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_VCO_EN_OVRD_EN</name>
              <description>Override control for RXTX_AUXPLL_VCO_EN</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of RXTX_AUXPLL_VCO_EN_OVRD to override the signal &quot;rxtx_auxpll_vco_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXTX_AUXPLL_VCO_EN_OVRD</name>
              <description>Override value for RXTX_AUXPLL_VCO_EN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_FCAL_EN_OVRD_EN</name>
              <description>Override control for RXTX_AUXPLL_FCAL_EN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of RXTX_AUXPLL_FCAL_EN_OVRD to override the signal &quot;rxtx_auxpll_fcal_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXTX_AUXPLL_FCAL_EN_OVRD</name>
              <description>Override value for RXTX_AUXPLL_FCAL_EN</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_LF_EN_OVRD_EN</name>
              <description>Override control for RXTX_AUXPLL_LF_EN</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of RXTX_AUXPLL_LF_EN_OVRD to override the signal &quot;rxtx_auxpll_lf_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXTX_AUXPLL_LF_EN_OVRD</name>
              <description>Override value for RXTX_AUXPLL_LF_EN</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_PD_EN_OVRD_EN</name>
              <description>Override control for RXTX_AUXPLL_PD_EN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of RXTX_AUXPLL_PD_EN_OVRD to override the signal &quot;rxtx_auxpll_pd_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXTX_AUXPLL_PD_EN_OVRD</name>
              <description>Override value for RXTX_AUXPLL_PD_EN</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN_OVRD_EN</name>
              <description>Override control for RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN_OVRD to override the signal &quot;rxtx_auxpll_pd_lf_filter_charge_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN_OVRD</name>
              <description>Override value for RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_ADC_BUF_EN_OVRD_EN</name>
              <description>Override control for RXTX_AUXPLL_ADC_BUF_EN</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of RXTX_AUXPLL_ADC_BUF_EN_OVRD to override the signal &quot;rxtx_auxpll_adc_buf_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXTX_AUXPLL_ADC_BUF_EN_OVRD</name>
              <description>Override value for RXTX_AUXPLL_ADC_BUF_EN</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_DIG_BUF_EN_OVRD_EN</name>
              <description>Override control for RXTX_AUXPLL_DIG_BUF_EN</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of RXTX_AUXPLL_DIG_BUF_EN_OVRD to override the signal &quot;rxtx_auxpll_dig_buf_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXTX_AUXPLL_DIG_BUF_EN_OVRD</name>
              <description>Override value for RXTX_AUXPLL_DIG_BUF_EN</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_RCCAL_EN_OVRD_EN</name>
              <description>Override control for RXTX_RCCAL_EN</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of RXTX_RCCAL_EN_OVRD to override the signal &quot;rxtx_rccal_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXTX_RCCAL_EN_OVRD</name>
              <description>Override value for RXTX_RCCAL_EN</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_HPM_DAC_EN_OVRD_EN</name>
              <description>Override control for TX_HPM_DAC_EN</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of TX_HPM_DAC_EN_OVRD to override the signal &quot;tx_hpm_dac_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_HPM_DAC_EN_OVRD</name>
              <description>Override value for TX_HPM_DAC_EN</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_MODE_OVRD_EN</name>
              <description>Override control for TX_MODE</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of TX_MODE_OVRD to override the signal &quot;tx_mode&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_MODE_OVRD</name>
              <description>Override value for TX_MODE</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_MODE_OVRD_EN</name>
              <description>Override control for RX_MODE</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of RX_MODE_OVRD to override the signal &quot;rx_mode&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_MODE_OVRD</name>
              <description>Override value for RX_MODE</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_POWER</name>
          <description>PA POWER</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PA_POWER</name>
              <description>PA POWER</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_RAMP_TBL0</name>
          <description>PA RAMP TABLE 0</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10080402</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PA_RAMP0</name>
              <description>PA_RAMP0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_RAMP1</name>
              <description>PA_RAMP1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_RAMP2</name>
              <description>PA_RAMP2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_RAMP3</name>
              <description>PA_RAMP3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_RAMP_TBL1</name>
          <description>PA RAMP TABLE 1</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3A342A1C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PA_RAMP4</name>
              <description>PA_RAMP4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_RAMP5</name>
              <description>PA_RAMP5</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_RAMP6</name>
              <description>PA_RAMP6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_RAMP7</name>
              <description>PA_RAMP7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RECYCLE_COUNT</name>
          <description>TSM RECYCLE COUNT</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1A0464</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RECYCLE_COUNT0</name>
              <description>TSM RX Recycle Count 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECYCLE_COUNT1</name>
              <description>TSM RX Recycle Count 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECYCLE_COUNT2</name>
              <description>TSM RX Recycle Count 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
