shijoe4/zephyr/ext/hal/nxp/mcux/devices/MKW21Z4/MKW21Z4.xml
        <register>
          <name>FAST_CTRL1</name>
          <description>TSM FAST WARMUP CONTROL REGISTER 1</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FAST_TX_WU_EN</name>
              <description>Fast TSM TX Warmup Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Fast TSM TX Warmups are disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Fast TSM TX Warmups are enabled, if the RF channel has not changed since the last TX warmup, and for BLE mode, the RF channel is not an advertising channel.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAST_RX_WU_EN</name>
              <description>Fast TSM RX Warmup Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Fast TSM RX Warmups are disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Fast TSM RX Warmups are enabled, if the RF channel has not changed since the last RX warmup, and for BLE mode, the RF channel is not an advertising channel.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAST_RX2TX_EN</name>
              <description>Fast TSM RX-to-TX Transition Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAST_WU_CLEAR</name>
              <description>Fast TSM Warmup Clear State</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAST_RX2TX_START</name>
              <description>TSM &quot;Jump-to&quot; point for a Fast TSM RX-to-TX Transition.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FAST_CTRL2</name>
          <description>TSM FAST WARMUP CONTROL REGISTER 2</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FAST_START_TX</name>
              <description>Fast TSM TX &quot;Jump-from&quot; Point</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAST_DEST_TX</name>
              <description>Fast TSM TX &quot;Jump-to&quot; Point</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAST_START_RX</name>
              <description>Fast TSM RX &quot;Jump-from&quot; Point</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAST_DEST_RX</name>
              <description>Fast TSM RX &quot;Jump-to&quot; Point</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING00</name>
          <description>TSM_TIMING00</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x67006A00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_LDO_HF_EN_TX_HI</name>
              <description>Assertion time setting for BB_LDO_HF_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_HF_EN_TX_LO</name>
              <description>De-assertion time setting for BB_LDO_HF_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_HF_EN_RX_HI</name>
              <description>Assertion time setting for BB_LDO_HF_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_HF_EN_RX_LO</name>
              <description>De-assertion time setting for BB_LDO_HF_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING01</name>
          <description>TSM_TIMING01</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x67006A00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_LDO_ADCDAC_EN_TX_HI</name>
              <description>Assertion time setting for BB_LDO_ADCDAC_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_ADCDAC_EN_TX_LO</name>
              <description>De-assertion time setting for BB_LDO_ADCDAC_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_ADCDAC_EN_RX_HI</name>
              <description>Assertion time setting for BB_LDO_ADCDAC_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_ADCDAC_EN_RX_LO</name>
              <description>De-assertion time setting for BB_LDO_ADCDAC_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING02</name>
          <description>TSM_TIMING02</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6700FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_LDO_BBA_EN_RX_HI</name>
              <description>Assertion time setting for BB_LDO_BBA_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_BBA_EN_RX_LO</name>
              <description>De-assertion time setting for BB_LDO_BBA_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING03</name>
          <description>TSM_TIMING03</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x67006A00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_LDO_PD_EN_TX_HI</name>
              <description>Assertion time setting for BB_LDO_PD_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_PD_EN_TX_LO</name>
              <description>De-assertion time setting for BB_LDO_PD_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_PD_EN_RX_HI</name>
              <description>Assertion time setting for BB_LDO_PD_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_PD_EN_RX_LO</name>
              <description>De-assertion time setting for BB_LDO_PD_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING04</name>
          <description>TSM_TIMING04</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x67006A00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_LDO_FDBK_EN_TX_HI</name>
              <description>Assertion time setting for BB_LDO_FDBK_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_FDBK_EN_TX_LO</name>
              <description>De-assertion time setting for BB_LDO_FDBK_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_FDBK_EN_RX_HI</name>
              <description>Assertion time setting for BB_LDO_FDBK_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_FDBK_EN_RX_LO</name>
              <description>De-assertion time setting for BB_LDO_FDBK_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING05</name>
          <description>TSM_TIMING05</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x67006A00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_LDO_VCOLO_EN_TX_HI</name>
              <description>Assertion time setting for BB_LDO_VCOLO_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VCOLO_EN_TX_LO</name>
              <description>De-assertion time setting for BB_LDO_VCOLO_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VCOLO_EN_RX_HI</name>
              <description>Assertion time setting for BB_LDO_VCOLO_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VCOLO_EN_RX_LO</name>
              <description>De-assertion time setting for BB_LDO_VCOLO_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING06</name>
          <description>TSM_TIMING06</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x67006A00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_LDO_VTREF_EN_TX_HI</name>
              <description>Assertion time setting for BB_LDO_VTREF_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VTREF_EN_TX_LO</name>
              <description>De-assertion time setting for BB_LDO_VTREF_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VTREF_EN_RX_HI</name>
              <description>Assertion time setting for BB_LDO_VTREF_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VTREF_EN_RX_LO</name>
              <description>De-assertion time setting for BB_LDO_VTREF_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING07</name>
          <description>TSM_TIMING07</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5000500</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_LDO_FDBK_BLEED_EN_TX_HI</name>
              <description>Assertion time setting for BB_LDO_FDBK_BLEED_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_FDBK_BLEED_EN_TX_LO</name>
              <description>De-assertion time setting for BB_LDO_FDBK_BLEED_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_FDBK_BLEED_EN_RX_HI</name>
              <description>Assertion time setting for BB_LDO_FDBK_BLEED_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_FDBK_BLEED_EN_RX_LO</name>
              <description>De-assertion time setting for BB_LDO_FDBK_BLEED_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING08</name>
          <description>TSM_TIMING08</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3000300</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_LDO_VCOLO_BLEED_EN_TX_HI</name>
              <description>Assertion time setting for BB_LDO_VCOLO_BLEED_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VCOLO_BLEED_EN_TX_LO</name>
              <description>De-assertion time setting for BB_LDO_VCOLO_BLEED_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VCOLO_BLEED_EN_RX_HI</name>
              <description>Assertion time setting for BB_LDO_VCOLO_BLEED_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VCOLO_BLEED_EN_RX_LO</name>
              <description>De-assertion time setting for BB_LDO_VCOLO_BLEED_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING09</name>
          <description>TSM_TIMING09</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3000300</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_LDO_VCOLO_FASTCHARGE_EN_TX_HI</name>
              <description>Assertion time setting for BB_LDO_VCOLO_FASTCHARGE_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VCOLO_FASTCHARGE_EN_TX_LO</name>
              <description>De-assertion time setting for BB_LDO_VCOLO_FASTCHARGE_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VCOLO_FASTCHARGE_EN_RX_HI</name>
              <description>Assertion time setting for BB_LDO_VCOLO_FASTCHARGE_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_LDO_VCOLO_FASTCHARGE_EN_RX_LO</name>
              <description>De-assertion time setting for BB_LDO_VCOLO_FASTCHARGE_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING10</name>
          <description>TSM_TIMING10</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x67036A03</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_XTAL_PLL_REF_CLK_EN_TX_HI</name>
              <description>Assertion time setting for BB_XTAL_PLL_REF_CLK_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_PLL_REF_CLK_EN_TX_LO</name>
              <description>De-assertion time setting for BB_XTAL_PLL_REF_CLK_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_PLL_REF_CLK_EN_RX_HI</name>
              <description>Assertion time setting for BB_XTAL_PLL_REF_CLK_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_PLL_REF_CLK_EN_RX_LO</name>
              <description>De-assertion time setting for BB_XTAL_PLL_REF_CLK_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING11</name>
          <description>TSM_TIMING11</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF6A03</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB_XTAL_DAC_REF_CLK_EN_TX_HI</name>
              <description>Assertion time setting for BB_XTAL_DAC_REF_CLK_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BB_XTAL_DAC_REF_CLK_EN_TX_LO</name>
              <description>De-assertion time setting for BB_XTAL_DAC_REF_CLK_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING12</name>
          <description>TSM_TIMING12</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6703FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTX_AUXPLL_VCO_REF_CLK_EN_RX_HI</name>
              <description>Assertion time setting for RXTX_AUXPLL_VCO_REF_CLK_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_VCO_REF_CLK_EN_RX_LO</name>
              <description>De-assertion time setting for RXTX_AUXPLL_VCO_REF_CLK_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
